app/controllers/converts_controller.rb

  def create
    require 'date'  #変換後ファイル名設定用
    require 'csv'
    require 'nkf'
    require 'rubyXL'
    require 'rubyXL/convenience_methods'    # フォントの変更機能を有効にするため
    require 'mini_magick'
    # require 'RMagick'

    @convert = Convert.new(convert_params)

    if @convert.save
---
INSERT INTO "converts" ("file", "created_at", "updated_at") VALUES (?, ?, ?)  [["file", "csv_20220204_142951_test_20220204172356.xlsx"], ["created_at", "2022-02-07 00:35:36.836941"], ["updated_at", "2022-02-07 00:35:36.836941"]]

  def destroy
    @convert.destroy
---
DELETE FROM "converts" WHERE "converts"."id" = ?  [["id", 3]]

    def set_convert
      @convert = Convert.find(params[:id])
---
SELECT "converts".* FROM "converts" WHERE "converts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]